sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_lptim.c
//  if ((hlptim->Init.Trigger.Source) !=  LPTIM_TRIGSOURCE_SOFTWARE)
//  {
//    /* Enable External trigger and set the trigger source */
//    tmpcfgr |= (hlptim->Init.Trigger.Source     |
//                hlptim->Init.Trigger.ActiveEdge |
//                hlptim->Init.Trigger.SampleTime);
//  }

    /* Write to LPTIMx CFGR */
    hlptim->Instance->CFGR = tmpcfgr;

    /* Configure LPTIM input sources */
//  if(hlptim->Instance == LPTIM)
//  {
//    /* Check LPTIM Input1 and Input2 sources */
//    assert_param(IS_LPTIM_INPUT1_SOURCE(hlptim->Instance,hlptim->Init.Input1Source));
//    assert_param(IS_LPTIM_INPUT2_SOURCE(hlptim->Instance,hlptim->Init.Input2Source));
//
//    /* Configure LPTIM Input1 and Input2 sources */
//    hlptim->Instance->CFGR2 = (hlptim->Init.Input1Source | hlptim->Init.Input2Source);
//  }
//  else
//  {
    /* Check LPTIM2 Input1 source */
    assert_param(IS_LPTIM_INPUT1_SOURCE(hlptim->Instance,hlptim->Init.Input1Source));

    /* Configure LPTIM2 Input1 source */
//    hlptim->Instance->CFGR2 = hlptim->Init.Input1Source;
//  }

    /* Change the LPTIM state */
    hlptim->State = HAL_LPTIM_STATE_READY;

    /* Return function status */
    return HAL_OK;
}

/**
  * @brief  DeInitialize the LPTIM peripheral.
  * @param  hlptim LPTIM handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPTIM_DeInit(LPTIM_HandleTypeDef *hlptim)
{
    /* Check the LPTIM handle allocation */
    if(hlptim == NULL)
    {
        return HAL_ERROR;
    }

    /* Change the LPTIM state */
    hlptim->State = HAL_LPTIM_STATE_BUSY;

    /* Disable the LPTIM Peripheral Clock */
    __HAL_LPTIM_DISABLE(hlptim);

#if (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
    if(hlptim->MspDeInitCallback == NULL)
    {
        hlptim->MspDeInitCallback = HAL_LPTIM_MspDeInit;
    }

    /* DeInit the low level hardware: CLOCK, NVIC.*/
    hlptim->MspDeInitCallback(hlptim);
#else
    /* DeInit the low level hardware: CLOCK, NVIC.*/
    HAL_LPTIM_MspDeInit(hlptim);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */

    /* Change the LPTIM state */
    hlptim->State = HAL_LPTIM_STATE_RESET;

    /* Release Lock */
    __HAL_UNLOCK(hlptim);

    /* Return function status */
    return HAL_OK;
}

/**
  * @brief  Initialize the LPTIM MSP.
  * @param  hlptim LPTIM handle
  * @retval None
  */
__weak void HAL_LPTIM_MspInit(LPTIM_HandleTypeDef *hlptim)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hlptim);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_LPTIM_MspInit could be implemented in the user file
     */
}

/**
  * @brief  DeInitialize LPTIM MSP.
  * @param  hlptim LPTIM handle
  * @retval None
  */
__weak void HAL_LPTIM_MspDeInit(LPTIM_HandleTypeDef *hlptim)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hlptim);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_LPTIM_MspDeInit could be implemented in the user file
     */
}

/**
  * @}
  */

/** @defgroup LPTIM_Exported_Functions_Group2 LPTIM Start-Stop operation functions
 *  @brief   Start-Stop operation functions.
 *
@verbatim
  ==============================================================================
                ##### LPTIM Start Stop operation functions #####
  ==============================================================================
    [..]  This section provides functions allowing to:
      (+) Start the PWM mode.
      (+) Stop the PWM mode.
      (+) Start the One pulse mode.
      (+) Stop the One pulse mode.
      (+) Start the Set once mode.
      (+) Stop the Set once mode.
      (+) Start the Encoder mode.
      (+) Stop the Encoder mode.
      (+) Start the Timeout mode.
      (+) Stop the Timeout mode.
      (+) Start the Counter mode.
      (+) Stop the Counter mode.


@endverbatim
  * @{
  */

///**
//  * @brief  Start the LPTIM PWM generation.
//  * @param  hlptim LPTIM handle
//  * @param  Period Specifies the Autoreload value.
//  *         This parameter must be a value between 0x0000 and 0xFFFF.
//  * @param  Pulse Specifies the compare value.
//  *         This parameter must be a value between 0x0000 and 0xFFFF.
//  * @retval HAL status
//  */
//HAL_StatusTypeDef HAL_LPTIM_PWM_Start(LPTIM_HandleTypeDef *hlptim, uint32_t Period, uint32_t Pulse)
//{
//  /* Check the parameters */
//  assert_param(IS_LPTIM_INSTANCE(hlptim->Instance));
//  assert_param(IS_LPTIM_PERIOD(Period));
//  assert_param(IS_LPTIM_PULSE(Pulse));
//
//  /* Set the LPTIM state */
//  hlptim->State= HAL_LPTIM_STATE_BUSY;
//
//  /* Reset WAVE bit to set PWM mode */
//  hlptim->Instance->CFGR &= ~LPTIM_CFGR_WAVE;
//
//  /* Enable the Peripheral */
//  __HAL_LPTIM_ENABLE(hlptim);
//
//  /* Load the period value in the autoreload register */
//  __HAL_LPTIM_AUTORELOAD_SET(hlptim, Period);
//
//  /* Load the pulse value in the compare register */
//  __HAL_LPTIM_COMPARE_SET(hlptim, Pulse);
//
//  /* Start timer in continuous mode */
//  __HAL_LPTIM_START_CONTINUOUS(hlptim);
//
//  /* Change the TIM state*/
//  hlptim->State= HAL_LPTIM_STATE_READY;
//
//  /* Return function status */
//  return HAL_OK;
//}

///**
//  * @brief  Stop the LPTIM PWM generation.
//  * @param  hlptim LPTIM handle
//  * @retval HAL status
//  */
//HAL_StatusTypeDef HAL_LPTIM_PWM_Stop(LPTIM_HandleTypeDef *hlptim)
//{
//  /* Check the parameters */
//  assert_param(IS_LPTIM_INSTANCE(hlptim->Instance));
//
//  /* Set the LPTIM state */
//  hlptim->State= HAL_LPTIM_STATE_BUSY;
//
//  /* Disable the Peripheral */
//  __HAL_LPTIM_DISABLE(hlptim);

//  /* Change the TIM state*/
//  hlptim->State= HAL_LPTIM_STATE_READY;
//
//  /* Return function status */
//  return HAL_OK;
//}

///**
//  * @brief  Start the LPTIM PWM generation in interrupt mode.
//  * @param  hlptim LPTIM handle
//  * @param  Period Specifies the Autoreload value.
//  *         This parameter must be a value between 0x0000 and 0xFFFF
//  * @param  Pulse Specifies the compare value.
//  *         This parameter must be a value between 0x0000 and 0xFFFF
//  * @retval HAL status
//  */
//HAL_StatusTypeDef HAL_LPTIM_PWM_Start_IT(LPTIM_HandleTypeDef *hlptim, uint32_t Period, uint32_t Pulse)
//{
//  /* Check the parameters */
//  assert_param(IS_LPTIM_INSTANCE(hlptim->Instance));
//  assert_param(IS_LPTIM_PERIOD(Period));
//  assert_param(IS_LPTIM_PULSE(Pulse));
//
//  /* Set the LPTIM state */
//  hlptim->State= HAL_LPTIM_STATE_BUSY;
//
//  /* Reset WAVE bit to set PWM mode */
//  hlptim->Instance->CFGR &= ~LPTIM_CFGR_WAVE;
//
//  /* Enable Autoreload write complete interrupt */
//  __HAL_LPTIM_ENABLE_IT(hlptim, LPTIM_IT_ARROK);
//
//  /* Enable Compare write complete interrupt */
//  __HAL_LPTIM_ENABLE_IT(hlptim, LPTIM_IT_CMPOK);
//
//  /* Enable Autoreload match interrupt */
//  __HAL_LPTIM_ENABLE_IT(hlptim, LPTIM_IT_ARRM);
//
//  /* Enable Compare match interrupt */
//  __HAL_LPTIM_ENABLE_IT(hlptim, LPTIM_IT_CMPM);
//
//  /* If external trigger source is used, then enable external trigger interrupt */
//  if ((hlptim->Init.Trigger.Source) !=  LPTIM_TRIGSOURCE_SOFTWARE)
//  {
//    /* Enable external trigger interrupt */
//    __HAL_LPTIM_ENABLE_IT(hlptim, LPTIM_IT_EXTTRIG);
//  }
//
//  /* Enable the Peripheral */
//  __HAL_LPTIM_ENABLE(hlptim);
//
//  /* Load the period value in the autoreload register */
//  __HAL_LPTIM_AUTORELOAD_SET(hlptim, Period);
//
//  /* Load the pulse value in the compare register */
//  __HAL_LPTIM_COMPARE_SET(hlptim, Pulse);
//
//  /* Start timer in continuous mode */
//  __HAL_LPTIM_START_CONTINUOUS(hlptim);
//
//  /* Change the TIM state*/
//  hlptim->State= HAL_LPTIM_STATE_READY;
//
//  /* Return function status */
//  return HAL_OK;
//}

///**
//  * @brief  Stop the LPTIM PWM generation in interrupt mode.
//  * @param  hlptim LPTIM handle
//  * @retval HAL status
//  */
//HAL_StatusTypeDef HAL_LPTIM_PWM_Stop_IT(LPTIM_HandleTypeDef *hlptim)
//{
//  /* Check the parameters */
//  assert_param(IS_LPTIM_INSTANCE(hlptim->Instance));
//
//  /* Set the LPTIM state */
//  hlptim->State= HAL_LPTIM_STATE_BUSY;
//
//  /* Disable the Peripheral */
//  __HAL_LPTIM_DISABLE(hlptim);
//
//    /* Disable Autoreload write complete interrupt */
//  __HAL_LPTIM_DISABLE_IT(hlptim, LPTIM_IT_ARROK);
//
//  /* Disable Compare write complete interrupt */
//  __HAL_LPTIM_DISABLE_IT(hlptim, LPTIM_IT_CMPOK);
//
//  /* Disable Autoreload match interrupt */
//  __HAL_LPTIM_DISABLE_IT(hlptim, LPTIM_IT_ARRM);
//
//  /* Disable Compare match interrupt */
//  __HAL_LPTIM_DISABLE_IT(hlptim, LPTIM_IT_CMPM);
//
//  /* If external trigger source is used, then disable external trigger interrupt */
//  if ((hlptim->Init.Trigger.Source) !=  LPTIM_TRIGSOURCE_SOFTWARE)
//  {
//    /* Disable external trigger interrupt */
//    __HAL_LPTIM_DISABLE_IT(hlptim, LPTIM_IT_EXTTRIG);
//  }

//  /* Change the TIM state*/
//  hlptim->State= HAL_LPTIM_STATE_READY;
//
//  /* Return function status */
//  return HAL_OK;
//}

/**
  * @brief  Start the LPTIM One pulse generation.
  * @param  hlptim LPTIM handle
  * @param  Period Specifies the Autoreload value.
  *         This parameter must be a value between 0x0000 and 0xFFFF.
  * @param  Pulse Specifies the compare value.
  *         This parameter must be a value between 0x0000 and 0xFFFF.
  * @retval HAL status
  */
//HAL_StatusTypeDef HAL_LPTIM_OnePulse_Start(LPTIM_HandleTypeDef *hlptim, uint32_t Period, uint32_t Pulse)
//{
//  /* Check the parameters */
//  assert_param(IS_LPTIM_INSTANCE(hlptim->Instance));
//  assert_param(IS_LPTIM_PERIOD(Period));
//  assert_param(IS_LPTIM_PULSE(Pulse));
//
//  /* Set the LPTIM state */
//  hlptim->State= HAL_LPTIM_STATE_BUSY;
//
//  /* Reset WAVE bit to set one pulse mode */
//  hlptim->Instance->CFGR &= ~LPTIM_CFGR_WAVE;
//
//  /* Enable the Peripheral */
//  __HAL_LPTIM_ENABLE(hlptim);
//
//  /* Load the period value in the autoreload register */
//  __HAL_LPTIM_AUTORELOAD_SET(hlptim, Period);
//
//  /* Load the pulse value in the compare register */
//  __HAL_LPTIM_COMPARE_SET(hlptim, Pulse);
//
//  /* Start timer in single (one shot) mode */
//  __HAL_LPTIM_START_SINGLE(hlptim);
//
//  /* Change the TIM state*/
//  hlptim->State= HAL_LPTIM_STATE_READY;
//
//  /* Return function status */
//  return HAL_OK;
//}

///**
//  * @brief  Stop the LPTIM One pulse generation.
//  * @param  hlptim LPTIM handle
//  * @retval HAL status
//  */
//HAL_StatusTypeDef HAL_LPTIM_OnePulse_Stop(LPTIM_HandleTypeDef *hlptim)
//{
//  /* Check the parameters */
//  assert_param(IS_LPTIM_INSTANCE(hlptim->Instance));
//
//  /* Set the LPTIM state */
//  hlptim->State= HAL_LPTIM_STATE_BUSY;
//
//  /* Disable the Peripheral */
//  __HAL_LPTIM_DISABLE(hlptim);

//  /* Change the TIM state*/
//  hlptim->State= HAL_LPTIM_STATE_READY;
//
//  /* Return function status */
//  return HAL_OK;
//}

///**
//  * @brief  Start the LPTIM One pulse generation in interrupt mode.
//  * @param  hlptim LPTIM handle
//  * @param  Period Specifies the Autoreload value.
//  *         This parameter must be a value between 0x0000 and 0xFFFF.
//  * @param  Pulse Specifies the compare value.
//  *         This parameter must be a value between 0x0000 and 0xFFFF.
//  * @retval HAL status
//  */
//HAL_StatusTypeDef HAL_LPTIM_OnePulse_Start_IT(LPTIM_HandleTypeDef *hlptim, uint32_t Period, uint32_t Pulse)
//{
//  /* Check the parameters */
//  assert_param(IS_LPTIM_INSTANCE(hlptim->Instance));
//  assert_param(IS_LPTIM_PERIOD(Period));
//  assert_param(IS_LPTIM_PULSE(Pulse));
//
//  /* Set the LPTIM state */
//  hlptim->State= HAL_LPTIM_STATE_BUSY;
//
//  /* Reset WAVE bit to set one pulse mode */
//  hlptim->Instance->CFGR &= ~LPTIM_CFGR_WAVE;
//
//  /* Enable Autoreload write complete interrupt */
//  __HAL_LPTIM_ENABLE_IT(hlptim, LPTIM_IT_ARROK);
//
//  /* Enable Compare write complete interrupt */
//  __HAL_LPTIM_ENABLE_IT(hlptim, LPTIM_IT_CMPOK);
//
//  /* Enable Autoreload match interrupt */
//  __HAL_LPTIM_ENABLE_IT(hlptim, LPTIM_IT_ARRM);
//
//  /* Enable Compare match interrupt */
//  __HAL_LPTIM_ENABLE_IT(hlptim, LPTIM_IT_CMPM);
//
//  /* If external trigger source is used, then enable external trigger interrupt */
//  if ((hlptim->Init.Trigger.Source) !=  LPTIM_TRIGSOURCE_SOFTWARE)
//  {
//    /* Enable external trigger interrupt */
//    __HAL_LPTIM_ENABLE_IT(hlptim, LPTIM_IT_EXTTRIG);
//  }
//
//  /* Enable the Peripheral */
//  __HAL_LPTIM_ENABLE(hlptim);
//
//  /* Load the period value in the autoreload register */
//  __HAL_LPTIM_AUTORELOAD_SET(hlptim, Period);
//
//  /* Load the pulse value in the compare register */
//  __HAL_LPTIM_COMPARE_SET(hlptim, Pulse);
//
//  /* Start timer in single (one shot) mode */
//  __HAL_LPTIM_START_SINGLE(hlptim);
//
//  /* Change the TIM state*/
//  hlptim->State= HAL_LPTIM_STATE_READY;
//
//  /* Return function status */
//  return HAL_OK;
//}

///**
//  * @brief  Stop the LPTIM One pulse generation in interrupt mode.
//  * @param  hlptim LPTIM handle
//  * @retval HAL status
//  */
//HAL_StatusTypeDef HAL_LPTIM_OnePulse_Stop_IT(LPTIM_HandleTypeDef *hlptim)
//{
//  /* Check the parameters */
//  assert_param(IS_LPTIM_INSTANCE(hlptim->Instance));
//
//  /* Set the LPTIM state */
//  hlptim->State= HAL_LPTIM_STATE_BUSY;
//
//  /* Disable the Peripheral */
//  __HAL_LPTIM_DISABLE(hlptim);
//
//  /* Disable Autoreload write complete interrupt */
//  __HAL_LPTIM_DISABLE_IT(hlptim, LPTIM_IT_ARROK);
//
//  /* Disable Compare write complete interrupt */
//  __HAL_LPTIM_DISABLE_IT(hlptim, LPTIM_IT_CMPOK);
//
//  /* Disable Autoreload match interrupt */
//  __HAL_LPTIM_DISABLE_IT(hlptim, LPTIM_IT_ARRM);
//
//  /* Disable Compare match interrupt */
//  __HAL_LPTIM_DISABLE_IT(hlptim, LPTIM_IT_CMPM);
//
//  /* If external trigger source is used, then disable external trigger interrupt */
//  if ((hlptim->Init.Trigger.Source) !=  LPTIM_TRIGSOURCE_SOFTWARE)
//  {
//    /* Disable external trigger interrupt */
//    __HAL_LPTIM_DISABLE_IT(hlptim, LPTIM_IT_EXTTRIG);
//  }
//
//  /* Change the TIM state*/
//  hlptim->State= HAL_LPTIM_STATE_READY;
//
//  /* Return function status */
//  return HAL_OK;
//}

/**
  * @brief  Start the LPTIM in Set once mode.
  * @param  hlptim LPTIM handle
  * @param  Period Specifies the Autoreload value.
  *         This parameter must be a value between 0x0000 and 0xFFFF.
  * @param  Pulse Specifies the compare value.
  *         This parameter must be a value between 0x0000 and 0xFFFF.
  * @retval HAL status
  */
//HAL_StatusTypeDef HAL_LPTIM_SetOnce_Start(LPTIM_HandleTypeDef *hlptim, uint32_t Period, uint32_t Pulse)
//{
//  /* Check the parameters */
//  assert_param(IS_LPTIM_INSTANCE(hlptim->Instance));
//  assert_param(IS_LPTIM_PERIOD(Period));
//  assert_param(IS_LPTIM_PULSE(Pulse));
//
//  /* Set the LPTIM state */
//  hlptim->State= HAL_LPTIM_STATE_BUSY;
//
//  /* Set WAVE bit to enable the set once mode */
//  hlptim->Instance->CFGR |= LPTIM_CFGR_WAVE;
//
//  /* Enable the Peripheral */
//  __HAL_LPTIM_ENABLE(hlptim);
//
//  /* Load the period value in the autoreload register */
//  __HAL_LPTIM_AUTORELOAD_SET(hlptim, Period);
//
//  /* Load the pulse value in the compare register */
//  __HAL_LPTIM_COMPARE_SET(hlptim, Pulse);
//
//  /* Start timer in single (one shot) mode */
//  __HAL_LPTIM_START_SINGLE(hlptim);
//
//  /* Change the TIM state*/
//  hlptim->State= HAL_LPTIM_STATE_READY;
//
//  /* Return function status */
//  return HAL_OK;
//}

///**
//  * @brief  Stop the LPTIM Set once mode.
//  * @param  hlptim LPTIM handle
//  * @retval HAL status
//  */
//HAL_StatusTypeDef HAL_LPTIM_SetOnce_Stop(LPTIM_HandleTypeDef *hlptim)
//{
//  /* Check the parameters */
//  assert_param(IS_LPTIM_INSTANCE(hlptim->Instance));
//
//  /* Set the LPTIM state */
//  hlptim->State= HAL_LPTIM_STATE_BUSY;
//
//  /* Disable the Peripheral */
//  __HAL_LPTIM_DISABLE(hlptim);

//  /* Change the TIM state*/
//  hlptim->State= HAL_LPTIM_STATE_READY;
//
//  /* Return function status */
//  return HAL_OK;
//}

///**
//  * @brief  Start the LPTIM Set once mode in interrupt mode.
//  * @param  hlptim LPTIM handle
//  * @param  Period Specifies the Autoreload value.
//  *         This parameter must be a value between 0x0000 and 0xFFFF.
//  * @param  Pulse Specifies the compare value.
//  *         This parameter must be a value between 0x0000 and 0xFFFF.
//  * @retval HAL status
//  */
//HAL_StatusTypeDef HAL_LPTIM_SetOnce_Start_IT(LPTIM_HandleTypeDef *hlptim, uint32_t Period, uint32_t Pulse)
//{
//  /* Check the parameters */
//  assert_param(IS_LPTIM_INSTANCE(hlptim->Instance));
//  assert_param(IS_LPTIM_PERIOD(Period));
//  assert_param(IS_LPTIM_PULSE(Pulse));
//
//  /* Set the LPTIM state */
//  hlptim->State= HAL_LPTIM_STATE_BUSY;
//
//  /* Set WAVE bit to enable the set once mode */
//  hlptim->Instance->CFGR |= LPTIM_CFGR_WAVE;
//
//  /* Enable Autoreload write complete interrupt */
//  __HAL_LPTIM_ENABLE_IT(hlptim, LPTIM_IT_ARROK);
//
//  /* Enable Compare write complete interrupt */
//  __HAL_LPTIM_ENABLE_IT(hlptim, LPTIM_IT_CMPOK);
//
//  /* Enable Autoreload match interrupt */
//  __HAL_LPTIM_ENABLE_IT(hlptim, LPTIM_IT_ARRM);
//
//  /* Enable Compare match interrupt */
//  __HAL_LPTIM_ENABLE_IT(hlptim, LPTIM_IT_CMPM);
//
//  /* If external trigger source is used, then enable external trigger interrupt */
//  if ((hlptim->Init.Trigger.Source) !=  LPTIM_TRIGSOURCE_SOFTWARE)
//  {
//    /* Enable external trigger interrupt */
//    __HAL_LPTIM_ENABLE_IT(hlptim, LPTIM_IT_EXTTRIG);
//  }
//
//  /* Enable the Peripheral */
//  __HAL_LPTIM_ENABLE(hlptim);
//
//  /* Load the period value in the autoreload register */
//  __HAL_LPTIM_AUTORELOAD_SET(hlptim, Period);
//
//  /* Load the pulse value in the compare register */
//  __HAL_LPTIM_COMPARE_SET(hlptim, Pulse);
//
//  /* Start timer in single (one shot) mode */
//  __HAL_LPTIM_START_SINGLE(hlptim);
//
//  /* Change the TIM state*/
//  hlptim->State= HAL_LPTIM_STATE_READY;
//
//  /* Return function status */
//  return HAL_OK;
//}

///**
//  * @brief  Stop the LPTIM Set once mode in interrupt mode.
//  * @param  hlptim LPTIM handle
//  * @retval HAL status
//  */
//HAL_StatusTypeDef HAL_LPTIM_SetOnce_Stop_IT(LPTIM_HandleTypeDef *hlptim)
//{
//  /* Check the parameters */
//  assert_param(IS_LPTIM_INSTANCE(hlptim->Instance));
//
//  /* Set the LPTIM state */
//  hlptim->State= HAL_LPTIM_STATE_BUSY;
//
//  /* Disable the Peripheral */
//  __HAL_LPTIM_DISABLE(hlptim);

//  /* Disable Autoreload write complete interrupt */
//  __HAL_LPTIM_DISABLE_IT(hlptim, LPTIM_IT_ARROK);
//
//  /* Disable Compare write complete interrupt */
//  __HAL_LPTIM_DISABLE_IT(hlptim, LPTIM_IT_CMPOK);
//
//  /* Disable Autoreload match interrupt */
//  __HAL_LPTIM_DISABLE_IT(hlptim, LPTIM_IT_ARRM);
//
//  /* Disable Compare match interrupt */
//  __HAL_LPTIM_DISABLE_IT(hlptim, LPTIM_IT_CMPM);
//
//  /* If external trigger source is used, then disable external trigger interrupt */
//  if ((hlptim->Init.Trigger.Source) !=  LPTIM_TRIGSOURCE_SOFTWARE)
//  {
//    /* Disable external trigger interrupt */
//    __HAL_LPTIM_DISABLE_IT(hlptim, LPTIM_IT_EXTTRIG);
//  }
//
//  /* Change the TIM state*/
//  hlptim->State= HAL_LPTIM_STATE_READY;
//
//  /* Return function status */
//  return HAL_OK;
//}

///**
//  * @brief  Start the Encoder interface.
//  * @param  hlptim LPTIM handle
//  * @param  Period Specifies the Autoreload value.
//  *         This parameter must be a value between 0x0000 and 0xFFFF.
//  * @retval HAL status
//  */
//HAL_StatusTypeDef HAL_LPTIM_Encoder_Start(LPTIM_HandleTypeDef *hlptim, uint32_t Period)
//{
//  uint32_t          tmpcfgr;

//  /* Check the parameters */
//  assert_param(IS_LPTIM_ENCODER_INTERFACE_INSTANCE(hlptim->Instance));
//  assert_param(IS_LPTIM_PERIOD(Period));
//  assert_param(hlptim->Init.Clock.Source == LPTIM_CLOCKSOURCE_APBCLOCK_LPOSC);
//  assert_param(hlptim->Init.Clock.Prescaler == LPTIM_PRESCALER_DIV1);
//  assert_param(IS_LPTIM_CLOCK_POLARITY(hlptim->Init.UltraLowPowerClock.Polarity));

//    /* Set the LPTIM state */
//    hlptim->State= HAL_LPTIM_STATE_BUSY;

//    /* Get the LPTIMx CFGR value */
//    tmpcfgr = hlptim->Instance->CFGR;

//    /* Clear CKPOL bits */
//    tmpcfgr &= (uint32_t)(~LPTIM_CFGR_CKPOL);

