sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_lptim.c
//    /* Set Input polarity */
//    tmpcfgr |=  hlptim->Init.UltraLowPowerClock.Polarity;

//    /* Write to LPTIMx CFGR */
//    hlptim->Instance->CFGR = tmpcfgr;

//    /* Set ENC bit to enable the encoder interface */
//    hlptim->Instance->CFGR |= LPTIM_CFGR_ENC;

//    /* Enable the Peripheral */
//    __HAL_LPTIM_ENABLE(hlptim);

//    /* Load the period value in the autoreload register */
//    __HAL_LPTIM_AUTORELOAD_SET(hlptim, Period);

//    /* Start timer in continuous mode */
//    __HAL_LPTIM_START_CONTINUOUS(hlptim);

//    /* Change the TIM state*/
//    hlptim->State= HAL_LPTIM_STATE_READY;

//  /* Return function status */
//  return HAL_OK;
//}

///**
//  * @brief  Stop the Encoder interface.
//  * @param  hlptim LPTIM handle
//  * @retval HAL status
//  */
//HAL_StatusTypeDef HAL_LPTIM_Encoder_Stop(LPTIM_HandleTypeDef *hlptim)
//{
//  /* Check the parameters */
//  assert_param(IS_LPTIM_ENCODER_INTERFACE_INSTANCE(hlptim->Instance));
//
//  /* Set the LPTIM state */
//  hlptim->State= HAL_LPTIM_STATE_BUSY;
//
//  /* Disable the Peripheral */
//  __HAL_LPTIM_DISABLE(hlptim);
//
//  /* Reset ENC bit to disable the encoder interface */
//  hlptim->Instance->CFGR &= ~LPTIM_CFGR_ENC;
//
//  /* Change the TIM state*/
//  hlptim->State= HAL_LPTIM_STATE_READY;
//
//  /* Return function status */
//  return HAL_OK;
//}

///**
//  * @brief  Start the Encoder interface in interrupt mode.
//  * @param  hlptim LPTIM handle
//  * @param  Period Specifies the Autoreload value.
//  *         This parameter must be a value between 0x0000 and 0xFFFF.
//  * @retval HAL status
//  */
//HAL_StatusTypeDef HAL_LPTIM_Encoder_Start_IT(LPTIM_HandleTypeDef *hlptim, uint32_t Period)
//{
//  uint32_t          tmpcfgr;

//  /* Check the parameters */
//  assert_param(IS_LPTIM_ENCODER_INTERFACE_INSTANCE(hlptim->Instance));
//  assert_param(IS_LPTIM_PERIOD(Period));
//  assert_param(hlptim->Init.Clock.Source == LPTIM_CLOCKSOURCE_APBCLOCK_LPOSC);
//  assert_param(hlptim->Init.Clock.Prescaler == LPTIM_PRESCALER_DIV1);
//  assert_param(IS_LPTIM_CLOCK_POLARITY(hlptim->Init.UltraLowPowerClock.Polarity));

//    /* Set the LPTIM state */
//    hlptim->State= HAL_LPTIM_STATE_BUSY;

//    /* Configure edge sensitivity for encoder mode */
//    /* Get the LPTIMx CFGR value */
//    tmpcfgr = hlptim->Instance->CFGR;

//    /* Clear CKPOL bits */
//    tmpcfgr &= (uint32_t)(~LPTIM_CFGR_CKPOL);

//    /* Set Input polarity */
//    tmpcfgr |=  hlptim->Init.UltraLowPowerClock.Polarity;

//    /* Write to LPTIMx CFGR */
//    hlptim->Instance->CFGR = tmpcfgr;

//    /* Set ENC bit to enable the encoder interface */
//    hlptim->Instance->CFGR |= LPTIM_CFGR_ENC;

//    /* Enable "switch to down direction" interrupt */
//    __HAL_LPTIM_ENABLE_IT(hlptim, LPTIM_IT_DOWN);

//    /* Enable "switch to up direction" interrupt */
//    __HAL_LPTIM_ENABLE_IT(hlptim, LPTIM_IT_UP);

//    /* Enable the Peripheral */
//    __HAL_LPTIM_ENABLE(hlptim);

//    /* Load the period value in the autoreload register */
//    __HAL_LPTIM_AUTORELOAD_SET(hlptim, Period);

//    /* Start timer in continuous mode */
//    __HAL_LPTIM_START_CONTINUOUS(hlptim);

//    /* Change the TIM state*/
//    hlptim->State= HAL_LPTIM_STATE_READY;

//  /* Return function status */
//  return HAL_OK;
//}

///**
//  * @brief  Stop the Encoder interface in interrupt mode.
//  * @param  hlptim LPTIM handle
//  * @retval HAL status
//  */
//HAL_StatusTypeDef HAL_LPTIM_Encoder_Stop_IT(LPTIM_HandleTypeDef *hlptim)
//{
//  /* Check the parameters */
//  assert_param(IS_LPTIM_ENCODER_INTERFACE_INSTANCE(hlptim->Instance));
//
//  /* Set the LPTIM state */
//  hlptim->State= HAL_LPTIM_STATE_BUSY;
//
//  /* Disable the Peripheral */
//  __HAL_LPTIM_DISABLE(hlptim);
//
//  /* Reset ENC bit to disable the encoder interface */
//  hlptim->Instance->CFGR &= ~LPTIM_CFGR_ENC;
//
//  /* Disable "switch to down direction" interrupt */
//  __HAL_LPTIM_DISABLE_IT(hlptim, LPTIM_IT_DOWN);
//
//  /* Disable "switch to up direction" interrupt */
//  __HAL_LPTIM_DISABLE_IT(hlptim, LPTIM_IT_UP);
//
//  /* Change the TIM state*/
//  hlptim->State= HAL_LPTIM_STATE_READY;
//
//  /* Return function status */
//  return HAL_OK;
//}

/**
  * @brief  Start the Timeout function.
  * @note   The first trigger event will start the timer, any successive
  *         trigger event will reset the counter and the timer restarts.
  * @param  hlptim LPTIM handle
  * @param  Period Specifies the Autoreload value.
  *         This parameter must be a value between 0x0000 and 0xFFFF.
  * @param  Timeout Specifies the TimeOut value to reset the counter.
  *         This parameter must be a value between 0x0000 and 0xFFFF.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPTIM_TimeOut_Start(LPTIM_HandleTypeDef *hlptim, uint32_t Period, uint32_t Timeout)
{
    /* Check the parameters */
    assert_param(IS_LPTIM_INSTANCE(hlptim->Instance));
    assert_param(IS_LPTIM_PERIOD(Period));
    assert_param(IS_LPTIM_PULSE(Timeout));

    /* Set the LPTIM state */
    hlptim->State= HAL_LPTIM_STATE_BUSY;

    /* Set TIMOUT bit to enable the timeout function */
//  hlptim->Instance->CFGR |= LPTIM_CFGR_TIMOUT;

    /* Enable the Peripheral */
    __HAL_LPTIM_ENABLE(hlptim);

    /* Load the period value in the autoreload register */
    __HAL_LPTIM_AUTORELOAD_SET(hlptim, Period);

    /* Load the Timeout value in the compare register */
//  __HAL_LPTIM_COMPARE_SET(hlptim, Timeout);

    /* Start timer in continuous mode */
//  __HAL_LPTIM_START_CONTINUOUS(hlptim);

    /* Change the TIM state*/
    hlptim->State= HAL_LPTIM_STATE_READY;

    /* Return function status */
    return HAL_OK;
}

/**
  * @brief  Stop the Timeout function.
  * @param  hlptim LPTIM handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPTIM_TimeOut_Stop(LPTIM_HandleTypeDef *hlptim)
{
    /* Check the parameters */
    assert_param(IS_LPTIM_INSTANCE(hlptim->Instance));

    /* Set the LPTIM state */
    hlptim->State= HAL_LPTIM_STATE_BUSY;

    /* Disable the Peripheral */
    __HAL_LPTIM_DISABLE(hlptim);

    /* Reset TIMOUT bit to enable the timeout function */
//  hlptim->Instance->CFGR &= ~LPTIM_CFGR_TIMOUT;

    /* Change the TIM state*/
    hlptim->State= HAL_LPTIM_STATE_READY;

    /* Return function status */
    return HAL_OK;
}

/**
  * @brief  Start the Timeout function in interrupt mode.
  * @note   The first trigger event will start the timer, any successive
  *         trigger event will reset the counter and the timer restarts.
  * @param  hlptim LPTIM handle
  * @param  Period Specifies the Autoreload value.
  *         This parameter must be a value between 0x0000 and 0xFFFF.
  * @param  Timeout Specifies the TimeOut value to reset the counter.
  *         This parameter must be a value between 0x0000 and 0xFFFF.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_LPTIM_TimeOut_Start_IT(LPTIM_HandleTypeDef *hlptim, uint32_t Period, uint32_t Timeout)
{
    /* Check the parameters */
    assert_param(IS_LPTIM_INSTANCE(hlptim->Instance));
    assert_param(IS_LPTIM_PERIOD(Period));
    assert_param(IS_LPTIM_PULSE(Timeout));

    /* Set the LPTIM state */
    hlptim->State= HAL_LPTIM_STATE_BUSY;

    /* Set TIMOUT bit to enable the timeout function */
//  hlptim->Instance->CFGR |= LPTIM_CFGR_TIMOUT;

