sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_lptim.c
    return (hlptim->Instance->CNT);
}

/**
  * @brief  Return the current Autoreload (Period) value.
  * @param  hlptim LPTIM handle
  * @retval Autoreload value.
  */
uint32_t HAL_LPTIM_ReadAutoReload(LPTIM_HandleTypeDef *hlptim)
{
    /* Check the parameters */
    assert_param(IS_LPTIM_INSTANCE(hlptim->Instance));

    return (hlptim->Instance->ARR);
}

/**
  * @brief  Return the current Compare (Pulse) value.
  * @param  hlptim LPTIM handle
  * @retval Compare value.
  */
//uint32_t HAL_LPTIM_ReadCompare(LPTIM_HandleTypeDef *hlptim)
//{
//    /* Check the parameters */
//  assert_param(IS_LPTIM_INSTANCE(hlptim->Instance));
//
//  return (hlptim->Instance->CMP);
//}

/**
  * @}
  */



/** @defgroup LPTIM_Exported_Functions_Group4 LPTIM IRQ handler and callbacks
 *  @brief  LPTIM  IRQ handler.
 *
@verbatim
  ==============================================================================
                      ##### LPTIM IRQ handler and callbacks  #####
  ==============================================================================
[..]  This section provides LPTIM IRQ handler and callback functions called within
      the IRQ handler:
   (+) LPTIM interrupt request handler
   (+) Compare match Callback
   (+) Auto-reload match Callback
   (+) External trigger event detection Callback
   (+) Compare register write complete Callback
   (+) Auto-reload register write complete Callback
   (+) Up-counting direction change Callback
   (+) Down-counting direction change Callback

@endverbatim
  * @{
  */

/**
  * @brief  Handle LPTIM interrupt request.
  * @param  hlptim LPTIM handle
  * @retval None
  */
void HAL_LPTIM_IRQHandler(LPTIM_HandleTypeDef *hlptim)
{
//  /* Compare match interrupt */
//  if(__HAL_LPTIM_GET_FLAG(hlptim, LPTIM_FLAG_CMPM) != RESET)
//  {
//    if(__HAL_LPTIM_GET_IT_SOURCE(hlptim, LPTIM_IT_CMPM) != RESET)
//    {
//      /* Clear Compare match flag */
//      __HAL_LPTIM_CLEAR_FLAG(hlptim, LPTIM_FLAG_CMPM);
//
//      /* Compare match Callback */
//#if (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
//          hlptim->CompareMatchCallback(hlptim);
//#else
//      HAL_LPTIM_CompareMatchCallback(hlptim);
//#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
//    }
//  }

    /* Autoreload match interrupt */
    if(__HAL_LPTIM_GET_FLAG(hlptim, LPTIM_FLAG_ARRM) != RESET)
    {
        if(__HAL_LPTIM_GET_IT_SOURCE(hlptim, LPTIM_IT_ARRM) != RESET)
        {
            /* Clear Autoreload match flag */
            __HAL_LPTIM_CLEAR_FLAG(hlptim, LPTIM_FLAG_ARRM);

            /* Autoreload match Callback */
#if (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
            hlptim->AutoReloadMatchCallback(hlptim);
#else
            HAL_LPTIM_AutoReloadMatchCallback(hlptim);
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
        }
    }

    /* Trigger detected interrupt */
//  if(__HAL_LPTIM_GET_FLAG(hlptim, LPTIM_FLAG_EXTTRIG) != RESET)
//  {
//    if(__HAL_LPTIM_GET_IT_SOURCE(hlptim, LPTIM_IT_EXTTRIG) != RESET)
//    {
//      /* Clear Trigger detected flag */
//      __HAL_LPTIM_CLEAR_FLAG(hlptim, LPTIM_FLAG_EXTTRIG);
//
//      /* Trigger detected callback */
//#if (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
//      hlptim->TriggerCallback(hlptim);
//#else
//      HAL_LPTIM_TriggerCallback(hlptim);
//#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
//    }
//  }

//  /* Compare write interrupt */
//  if(__HAL_LPTIM_GET_FLAG(hlptim, LPTIM_FLAG_CMPOK) != RESET)
//  {
//    if(__HAL_LPTIM_GET_IT_SOURCE(hlptim, LPTIM_IT_CMPOK) != RESET)
//    {
//      /* Clear Compare write flag */
//      __HAL_LPTIM_CLEAR_FLAG(hlptim, LPTIM_FLAG_CMPOK);
//
//      /* Compare write Callback */
//#if (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
//      hlptim->CompareWriteCallback(hlptim);
//#else
//      HAL_LPTIM_CompareWriteCallback(hlptim);
//#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
//    }
//  }

    /* Autoreload write interrupt */
//  if(__HAL_LPTIM_GET_FLAG(hlptim, LPTIM_FLAG_ARROK) != RESET)
//  {
//    if(__HAL_LPTIM_GET_IT_SOURCE(hlptim, LPTIM_IT_ARROK) != RESET)
//    {
//      /* Clear Autoreload write flag */
//      __HAL_LPTIM_CLEAR_FLAG(hlptim, LPTIM_FLAG_ARROK);
//
//      /* Autoreload write Callback */
//#if (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
//      hlptim->AutoReloadWriteCallback(hlptim);
//#else
//      HAL_LPTIM_AutoReloadWriteCallback(hlptim);
//#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
//    }
//  }

//  /* Direction counter changed from Down to Up interrupt */
//  if(__HAL_LPTIM_GET_FLAG(hlptim, LPTIM_FLAG_UP) != RESET)
//  {
//    if(__HAL_LPTIM_GET_IT_SOURCE(hlptim, LPTIM_IT_UP) != RESET)
//    {
//      /* Clear Direction counter changed from Down to Up flag */
//      __HAL_LPTIM_CLEAR_FLAG(hlptim, LPTIM_FLAG_UP);
//
//      /* Direction counter changed from Down to Up Callback */
//#if (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
//      hlptim->DirectionUpCallback(hlptim);
//#else
//      HAL_LPTIM_DirectionUpCallback(hlptim);
//#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
//    }
//  }
//
//  /* Direction counter changed from Up to Down interrupt */
//  if(__HAL_LPTIM_GET_FLAG(hlptim, LPTIM_FLAG_DOWN) != RESET)
//  {
//    if(__HAL_LPTIM_GET_IT_SOURCE(hlptim, LPTIM_IT_DOWN) != RESET)
//    {
//      /* Clear Direction counter changed from Up to Down flag */
//      __HAL_LPTIM_CLEAR_FLAG(hlptim, LPTIM_FLAG_DOWN);
//
//      /* Direction counter changed from Up to Down Callback */
//#if (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
//      hlptim->DirectionDownCallback(hlptim);
//#else
//      HAL_LPTIM_DirectionDownCallback(hlptim);
//#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */
//    }
//  }
}

/**
  * @brief  Compare match callback in non-blocking mode.
  * @param  hlptim LPTIM handle
  * @retval None
  */
__weak void HAL_LPTIM_CompareMatchCallback(LPTIM_HandleTypeDef *hlptim)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hlptim);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_LPTIM_CompareMatchCallback could be implemented in the user file
     */
}

/**
  * @brief  Autoreload match callback in non-blocking mode.
  * @param  hlptim LPTIM handle
  * @retval None
  */
__weak void HAL_LPTIM_AutoReloadMatchCallback(LPTIM_HandleTypeDef *hlptim)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hlptim);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_LPTIM_AutoReloadMatchCallback could be implemented in the user file
     */
}

/**
  * @brief  Trigger detected callback in non-blocking mode.
  * @param  hlptim LPTIM handle
  * @retval None
  */
__weak void HAL_LPTIM_TriggerCallback(LPTIM_HandleTypeDef *hlptim)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hlptim);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_LPTIM_TriggerCallback could be implemented in the user file
     */
}

/**
  * @brief  Compare write callback in non-blocking mode.
  * @param  hlptim LPTIM handle
  * @retval None
  */
__weak void HAL_LPTIM_CompareWriteCallback(LPTIM_HandleTypeDef *hlptim)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hlptim);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_LPTIM_CompareWriteCallback could be implemented in the user file
     */
}

/**
  * @brief  Autoreload write callback in non-blocking mode.
  * @param  hlptim LPTIM handle
  * @retval None
  */
__weak void HAL_LPTIM_AutoReloadWriteCallback(LPTIM_HandleTypeDef *hlptim)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hlptim);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_LPTIM_AutoReloadWriteCallback could be implemented in the user file
     */
}

/**
  * @brief  Direction counter changed from Down to Up callback in non-blocking mode.
  * @param  hlptim LPTIM handle
  * @retval None
  */
__weak void HAL_LPTIM_DirectionUpCallback(LPTIM_HandleTypeDef *hlptim)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hlptim);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_LPTIM_DirectionUpCallback could be implemented in the user file
     */
}

/**
  * @brief  Direction counter changed from Up to Down callback in non-blocking mode.
  * @param  hlptim LPTIM handle
  * @retval None
  */
__weak void HAL_LPTIM_DirectionDownCallback(LPTIM_HandleTypeDef *hlptim)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hlptim);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_LPTIM_DirectionDownCallback could be implemented in the user file
     */
}

#if (USE_HAL_LPTIM_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User LPTIM callback to be used instead of the weak predefined callback
  * @param hlptim LPTIM handle
  * @param CallbackID ID of the callback to be registered
  *        This parameter can be one of the following values:
  *          @arg @ref HAL_LPTIM_MSPINIT_CB_ID          LPTIM Base Msp Init Callback ID
  *          @arg @ref HAL_LPTIM_MSPDEINIT_CB_ID        LPTIM Base Msp DeInit Callback ID
  *          @arg @ref HAL_LPTIM_COMPARE_MATCH_CB_ID    Compare match Callback ID
  *          @arg @ref HAL_LPTIM_AUTORELOAD_MATCH_CB_ID Auto-reload match Callback ID
  *          @arg @ref HAL_LPTIM_TRIGGER_CB_ID          External trigger event detection Callback ID
  *          @arg @ref HAL_LPTIM_COMPARE_WRITE_CB_ID    Compare register write complete Callback ID
  *          @arg @ref HAL_LPTIM_AUTORELOAD_WRITE_CB_ID Auto-reload register write complete Callback ID
  *          @arg @ref HAL_LPTIM_DIRECTION_UP_CB_ID     Up-counting direction change Callback ID
  *          @arg @ref HAL_LPTIM_DIRECTION_DOWN_CB_ID   Down-counting direction change Callback ID
  * @param pCallback pointer to the callback function
  * @retval status
  */
HAL_StatusTypeDef HAL_LPTIM_RegisterCallback(LPTIM_HandleTypeDef *       hlptim,
        HAL_LPTIM_CallbackIDTypeDef CallbackID,
        pLPTIM_CallbackTypeDef      pCallback)
{
    HAL_StatusTypeDef status = HAL_OK;

