sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_lptim.c
    if(pCallback == NULL)
    {
        return HAL_ERROR;
    }

    /* Process locked */
    __HAL_LOCK(hlptim);

    if(hlptim->State == HAL_LPTIM_STATE_READY)
    {
        switch (CallbackID)
        {
        case HAL_LPTIM_MSPINIT_CB_ID :
            hlptim->MspInitCallback = pCallback;
            break;

        case HAL_LPTIM_MSPDEINIT_CB_ID :
            hlptim->MspDeInitCallback = pCallback;
            break;

        case HAL_LPTIM_COMPARE_MATCH_CB_ID :
            hlptim->CompareMatchCallback = pCallback;
            break;

        case HAL_LPTIM_AUTORELOAD_MATCH_CB_ID :
            hlptim->AutoReloadMatchCallback = pCallback;
            break;

        case HAL_LPTIM_TRIGGER_CB_ID :
            hlptim->TriggerCallback = pCallback;
            break;

        case HAL_LPTIM_COMPARE_WRITE_CB_ID :
            hlptim->CompareWriteCallback = pCallback;
            break;

        case HAL_LPTIM_AUTORELOAD_WRITE_CB_ID :
            hlptim->AutoReloadWriteCallback = pCallback;
            break;

        case HAL_LPTIM_DIRECTION_UP_CB_ID :
            hlptim->DirectionUpCallback = pCallback;
            break;

        case HAL_LPTIM_DIRECTION_DOWN_CB_ID :
            hlptim->DirectionDownCallback = pCallback;
            break;

        default :
            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else if(hlptim->State == HAL_LPTIM_STATE_RESET)
    {
        switch (CallbackID)
        {
        case HAL_LPTIM_MSPINIT_CB_ID :
            hlptim->MspInitCallback = pCallback;
            break;

        case HAL_LPTIM_MSPDEINIT_CB_ID :
            hlptim->MspDeInitCallback = pCallback;
            break;

        default :
            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else
    {
        /* Return error status */
        status =  HAL_ERROR;
    }

    /* Release Lock */
    __HAL_UNLOCK(hlptim);

    return status;
}

/**
  * @brief  Unregister a LPTIM callback
  *         LLPTIM callback is redirected to the weak predefined callback
  * @param hlptim LPTIM handle
  * @param CallbackID ID of the callback to be unregistered
  *        This parameter can be one of the following values:
  *          @arg @ref HAL_LPTIM_MSPINIT_CB_ID          LPTIM Base Msp Init Callback ID
  *          @arg @ref HAL_LPTIM_MSPDEINIT_CB_ID        LPTIM Base Msp DeInit Callback ID
  *          @arg @ref HAL_LPTIM_COMPARE_MATCH_CB_ID    Compare match Callback ID
  *          @arg @ref HAL_LPTIM_AUTORELOAD_MATCH_CB_ID Auto-reload match Callback ID
  *          @arg @ref HAL_LPTIM_TRIGGER_CB_ID          External trigger event detection Callback ID
  *          @arg @ref HAL_LPTIM_COMPARE_WRITE_CB_ID    Compare register write complete Callback ID
  *          @arg @ref HAL_LPTIM_AUTORELOAD_WRITE_CB_ID Auto-reload register write complete Callback ID
  *          @arg @ref HAL_LPTIM_DIRECTION_UP_CB_ID     Up-counting direction change Callback ID
  *          @arg @ref HAL_LPTIM_DIRECTION_DOWN_CB_ID   Down-counting direction change Callback ID
  * @retval status
  */
HAL_StatusTypeDef HAL_LPTIM_UnRegisterCallback(LPTIM_HandleTypeDef *       hlptim,
        HAL_LPTIM_CallbackIDTypeDef CallbackID)
{
    HAL_StatusTypeDef status = HAL_OK;

    /* Process locked */
    __HAL_LOCK(hlptim);

    if(hlptim->State == HAL_LPTIM_STATE_READY)
    {
        switch (CallbackID)
        {
        case HAL_LPTIM_MSPINIT_CB_ID :
            hlptim->MspInitCallback = HAL_LPTIM_MspInit;                          /* Legacy weak MspInit Callback */
            break;

        case HAL_LPTIM_MSPDEINIT_CB_ID :
            hlptim->MspDeInitCallback = HAL_LPTIM_MspDeInit;                       /* Legacy weak Msp DeInit Callback */
            break;

        case HAL_LPTIM_COMPARE_MATCH_CB_ID :
            hlptim->CompareMatchCallback = HAL_LPTIM_CompareMatchCallback;         /* Legacy weak IC Msp Init Callback */
            break;

        case HAL_LPTIM_AUTORELOAD_MATCH_CB_ID :
            hlptim->AutoReloadMatchCallback = HAL_LPTIM_AutoReloadMatchCallback;   /* Legacy weak IC Msp DeInit Callback */
            break;

        case HAL_LPTIM_TRIGGER_CB_ID :
            hlptim->TriggerCallback = HAL_LPTIM_TriggerCallback;                   /* Legacy weak OC Msp Init Callback */
            break;

        case HAL_LPTIM_COMPARE_WRITE_CB_ID :
            hlptim->CompareWriteCallback = HAL_LPTIM_CompareWriteCallback;         /* Legacy weak OC Msp DeInit Callback */
            break;

        case HAL_LPTIM_AUTORELOAD_WRITE_CB_ID :
            hlptim->AutoReloadWriteCallback = HAL_LPTIM_AutoReloadWriteCallback;   /* Legacy weak PWM Msp Init Callback */
            break;

        case HAL_LPTIM_DIRECTION_UP_CB_ID :
            hlptim->DirectionUpCallback = HAL_LPTIM_DirectionUpCallback;           /* Legacy weak PWM Msp DeInit Callback */
            break;

        case HAL_LPTIM_DIRECTION_DOWN_CB_ID :
            hlptim->DirectionDownCallback = HAL_LPTIM_DirectionDownCallback;       /* Legacy weak One Pulse Msp Init Callback */
            break;

        default :
            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else if(hlptim->State == HAL_LPTIM_STATE_RESET)
    {
        switch (CallbackID)
        {
        case HAL_LPTIM_MSPINIT_CB_ID :
            hlptim->MspInitCallback = HAL_LPTIM_MspInit;                           /* Legacy weak MspInit Callback */
            break;

        case HAL_LPTIM_MSPDEINIT_CB_ID :
            hlptim->MspDeInitCallback = HAL_LPTIM_MspDeInit;                        /* Legacy weak Msp DeInit Callback */
            break;

        default :
            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else
    {
        /* Return error status */
        status =  HAL_ERROR;
    }

    /* Release Lock */
    __HAL_UNLOCK(hlptim);

    return status;
}
#endif /* USE_HAL_LPTIM_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup LPTIM_Group5 Peripheral State functions
 *  @brief   Peripheral State functions.
 *
@verbatim
  ==============================================================================
                      ##### Peripheral State functions #####
  ==============================================================================
    [..]
    This subsection permits to get in run-time the status of the peripheral.

@endverbatim
  * @{
  */

/**
  * @brief  Return the LPTIM handle state.
  * @param  hlptim LPTIM handle
  * @retval HAL state
  */
HAL_LPTIM_StateTypeDef HAL_LPTIM_GetState(LPTIM_HandleTypeDef *hlptim)
{
    /* Return LPTIM handle state */
    return hlptim->State;
}

/**
  * @}
  */


/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/

